irun(64): 15.20-s045: (c) Copyright 1995-2018 Cadence Design Systems, Inc.
file: ./netlist.vams
	module ECE_6240_Digital.hw3_1_4_Input_NOR:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw1_1_c_inverter:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw3_1_adder_4bit:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw3_1_adder_4bit_tb:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw3_1_4_Input_OR:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw1_3_CMOS_2_Input_NAND:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw3_1_2_Input_AND:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw1_3_CMOS_3_Input_NOR:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw3_1_3_Input_OR:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw1_3_CMOS_3_Input_NAND:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw3_1_3_Input_AND:schematic
		errors: 0, warnings: 0
	module ECE_6240_Digital.hw3_1_adder_1bit:schematic
		errors: 0, warnings: 0
file: ./cds_globals.vams
	module worklib.cds_globals:vams
		errors: 0, warnings: 0
file: /home/seas/jwcrandall/cadence/ECE_6240_Digital/hw3_1_adder_4bit_tb_vdriver/functional/verilog.v
	module ECE_6240_Digital.hw3_1_adder_4bit_tb_vdriver:functional
		errors: 0, warnings: 0
ncvlog: *W,SPDUSD: Include directory /home/seas/jwcrandall/cadence/ given but not used.
	Total errors/warnings found outside modules and primitives:
		errors: 0, warnings: 1
ncvlog: Memory Usage - 21.3M program + 28.7M data = 50.0M total
ncvlog: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.1s, 23.8% cpu)

		Caching library 'ECE_6240_Digital' ....... Done
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		hw3_1_adder_4bit_tb
		cds_globals
	Discipline resolution Pass...
	Doing auto-insertion of connection elements...
	Connect Rules applied are:
		ConnRules_5V_full_fast
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library ECE_6240_Digital
	Generating native compiled code:
		ECE_6240_Digital.hw3_1_adder_4bit_tb_vdriver:functional <0x3723aae3>
			streams:   1, words:  6812
		connectLib.E2L_2:module <0x616d3cac>
			streams:   9, words:  9526
		connectLib.L2E_2:module <0x30a126c6>
			streams:   4, words:  8792
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:               142      32
		Registers:             109     133
		Scalar wires:           29       -
		Expanded wires:          8       2
		Vectored wires:         14       -
		Always blocks:          53      55
		Initial blocks:         15      25
		Cont. assignments:      14      21
		Interconnect:          159       -
		Simulation timescale:  1ps
	Writing initial simulation snapshot: ECE_6240_Digital.hw3_1_adder_4bit_tb:config
ncelab: Memory Usage - 49.8M program + 54.0M data = 103.8M total (Peak 237.3M)
ncelab: CPU Usage - 0.1s system + 0.1s user = 0.1s total (0.3s, 36.5% cpu)
Loading snapshot ECE_6240_Digital.hw3_1_adder_4bit_tb:config .................... Done
Simulating in AMS-SIE mode...
	Starting analog simulation engine...
AMSD: Using spectre solver with arguments: -ahdllibdir INCA_libs/AMSD/ahdlSimDB.

Cadence (R) Virtuoso (R) Spectre (R) Circuit Simulator
Version 15.1.0.803.isr18 64bit -- 25 Jul 2017
Copyright (C) 1989-2017 Cadence Design Systems, Inc. All rights reserved
        worldwide. Cadence, Virtuoso and Spectre are registered trademarks of
        Cadence Design Systems, Inc. All others are the property of their
        respective holders.

Includes RSA BSAFE(R) Cryptographic or Security Protocol Software from RSA
        Security, Inc.

User: jwcrandall   Host: linux02.cflab.seas.gwu.edu   HostID: A4801F8B   PID:
        22199
Memory  available: 28.7322 GB  physical: 33.5891 GB
Linux   : CentOS release 6.10 (Final)
CPU Type: Intel(R) Xeon(R) CPU E5-1620 v3 @ 3.50GHz
All processors running at 3492.1 MHz
        Socket: Processors (Hyperthreaded Processor)
        0:       0 (  4 ),  1 (  5 ),  2 (  6 ),  3 (  7 )
        
System load averages (1min, 5min, 15min) : 2.0 %, 1.6 %, 0.5 %
Hyperthreading is enabled


Analog Kernel using -ANALOGCONTROL  ./spiceModels.scs.
Reading file: 
        /home/seas/jwcrandall/cadence/simulation/hw3_1_adder_4bit_tb/ams/config/netlist/spiceModels.scs
Compiling ahdlcmi module library.
Finished compilation in 1.56 s (elapsed).
Installed compiled interface for
        connectLib__L2E_2__module__0x10000001_behavioral.
Compiling ahdlcmi module library.
Finished compilation in 899 ms (elapsed).
Installed compiled interface for
        connectLib__E2L_2__module__0x10000001_behavioral.
Reading file: 
        /apps/vlsi_2018/cadence/INCISIVE152/tools.lnx86/spectre/etc/configs/mapsubckt.cfg
Reading file: 
        /apps/design_kits/ncsu-cdk-1.6.0.beta/models/spectre/nom/ami06N.m
Reading file: 
        /apps/design_kits/ncsu-cdk-1.6.0.beta/models/spectre/nom/ami06P.m
Reading file: 
        /home/seas/jwcrandall/cadence/simulation/hw3_1_adder_4bit_tb/ams/config/netlist/amsControlSpectre.scs
Reading file: 
        /home/seas/jwcrandall/cadence/simulation/hw3_1_adder_4bit_tb/ams/config/netlist/.amsbind.scs
Reading file: 
        /apps/vlsi_2018/cadence/INCISIVE152/tools.lnx86/spectre/etc/configs/spectre.cfg
Time for NDB Parsing: CPU = 158.977 ms, elapsed = 3.31021 s.
Time accumulated: CPU = 306.953 ms, elapsed = 3.31021 s.
Peak resident memory used = 86.1 Mbytes.

ncsim> source /apps/vlsi_2018/cadence/INCISIVE152/tools/inca/files/ncsimrc
ncsim> 
ncsim> # This is the NC-SIM(R) probe command file
ncsim> # used in the AMS-ADE integration.
ncsim> 
ncsim> 
ncsim> #
ncsim> # Database settings
ncsim> #
ncsim> if { [info exists ::env(AMS_RESULTS_DIR) ] } { set AMS_RESULTS_DIR $env(AMS_RESULTS_DIR)} else {set AMS_RESULTS_DIR "../psf"}
../psf
ncsim> database -open ams_database -into ${AMS_RESULTS_DIR} -default
Created default SHM database ams_database
ncsim> 
ncsim> #
ncsim> # Probe settings
ncsim> #
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.A_data[0]}
Created probe 1
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.A_data[1]}
Created probe 2
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.A_data[2]}
Created probe 3
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.A_data[3]}
Created probe 4
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.B_data[0]}
Created probe 5
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.B_data[1]}
Created probe 6
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.B_data[2]}
Created probe 7
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.B_data[3]}
Created probe 8
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.Cin}
Created probe 9
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.sum[3]}
Created probe 10
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.sum[2]}
Created probe 11
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.sum[1]}
Created probe 12
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.sum[0]}
Created probe 13
ncsim> probe -create -emptyok -database ams_database {hw3_1_adder_4bit_tb.Cout}
Created probe 14
ncsim> 
ncsim> run

The CPU load for active processors is :
        Spectre  0 (25.6 %)      1 (12.3 %)      2 (26.2 %)      3 (10.8 %)
                 4 (14.3 %)      5 (27.4 %)      6 (12.3 %)      7 (13.1 %)
        Other   
Reading link: 
        /apps/vlsi_2018/cadence/INCISIVE152/tools.lnx86/spectre/etc/ahdl/discipline.h
Reading file: 
        /apps/vlsi_2018/cadence/INCISIVE152/tools.lnx86/spectre/etc/ahdl/disciplines.vams
Reading link: 
        /apps/vlsi_2018/cadence/INCISIVE152/tools.lnx86/spectre/etc/ahdl/constants.h
Reading file: 
        /apps/vlsi_2018/cadence/INCISIVE152/tools.lnx86/spectre/etc/ahdl/constants.vams
Time for Elaboration: CPU = 78.988 ms, elapsed = 142.386 ms.
Time accumulated: CPU = 385.941 ms, elapsed = 3.45271 s.
Peak resident memory used = 107 Mbytes.

Time for EDB Visiting: CPU = 3.999 ms, elapsed = 4.0319 ms.
Time accumulated: CPU = 389.94 ms, elapsed = 3.45687 s.
Peak resident memory used = 108 Mbytes.


Global user options:
      addflowsuffix = yes
        dotprobefmt = hier
               temp = 27
             reltol = 0.001
            vabstol = 1e-06
            iabstol = 1e-12
               gmin = 1e-12
             rforce = 1
           maxnotes = 5
           maxwarns = 5
             digits = 5
             pivrel = 0.001
     checklimitdest = psf
             rawfmt = sst2
               save = selected
               tnom = 25
              scale = 1
             scalem = 1

Scoped user options:

Circuit inventory:
              nodes 161
            bsim3v3 296   
connectLib__E2L_2__module__0x10000001_behavioral 5     
connectLib__L2E_2__module__0x10000001_behavioral 9     
            vsource 1     

Analysis and control statement inventory:
               info 4     
               tran 1     

Output statements:
             .probe 0     
           .measure 0     
               save 14    

Time for parsing: CPU = 2.999 ms, elapsed = 4.16589 ms.
Time accumulated: CPU = 392.939 ms, elapsed = 3.46115 s.
Peak resident memory used = 109 Mbytes.

~~~~~~~~~~~~~~~~~~~~~~
Pre-Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~

**********************************************
Transient Analysis `tran': time = (0 s -> 1 s)
**********************************************

Notice from spectre during IC analysis, during transient analysis `tran'.
    GminDC = 1 pS is large enough to noticeably affect the DC solution.
        dV(hw3_1_adder_4bit_tb.I13.I3.I34.I0.net20) = -29.4172 mV
        Use the `gmin_check' option to eliminate or expand this report.
    Bad pivoting is found during DC analysis. Option dc_pivot_check=yes is
        recommended for possible improvement of convergence.

DC simulation time: CPU = 12.998 ms, elapsed = 12.9681 ms.
Important parameter values:
    start = 0 s
    outputstart = 0 s
    stop = 1 s
    step = 1 ms
    maxstep = 20 ms
    ic = all
    useprevic = no
    skipdc = no
    reltol = 1e-03
    abstol(V) = 1 uV
    abstol(I) = 1 pA
    temp = 27 C
    tnom = 25 C
    tempeffects = all
    errpreset = moderate
    method = traponly
    lteratio = 3.5
    relref = sigglobal
    cmin = 0 F
    gmin = 1 pS


Output and IC/nodeset summary:
                 save   14      (voltage)

Pass: A_input =  0, B_input =  0, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  1, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  2, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  3, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  4, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  5, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  6, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  7, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  8, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  9, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 10, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 11, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 12, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 13, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 14, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 15, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  0, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  1, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  2, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  3, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  4, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  5, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  6, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  7, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  8, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  9, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 10, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 11, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 12, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 13, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 14, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 15, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1

Notice from spectre at time = 6.18334 ms during transient analysis `tran'.
    Found trapezoidal ringing on node hw3_1_adder_4bit_tb.sum[3].
Pass: A_input =  2, B_input =  0, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  1, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  2, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  3, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  4, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  5, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  6, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  7, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  8, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  9, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input = 10, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input = 11, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input = 12, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input = 13, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input = 14, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  2, B_input = 15, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  3, B_input =  0, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  1, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  2, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  3, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  4, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  5, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  6, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  7, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  8, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  9, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input = 10, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input = 11, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input = 12, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input = 13, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  3, B_input = 14, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  3, B_input = 15, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  4, B_input =  0, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  1, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  2, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  3, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  4, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  5, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  6, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  7, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  8, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  9, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input = 10, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input = 11, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input = 12, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  4, B_input = 13, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  4, B_input = 14, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  4, B_input = 15, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input =  0, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  1, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  2, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Notice from spectre at time = 14.3 ms during transient analysis `tran'.
    Found trapezoidal ringing on node hw3_1_adder_4bit_tb.sum[3].
Pass: A_input =  5, B_input =  3, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  4, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  5, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  6, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  7, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  8, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  9, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input = 10, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input = 11, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input = 12, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input = 13, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input = 14, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input = 15, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Notice from spectre at time = 16.3 ms during transient analysis `tran'.
    Found trapezoidal ringing on node hw3_1_adder_4bit_tb.sum[1].
Pass: A_input =  6, B_input =  0, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  1, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0

    tran: time = 16.8 ms     (1.68 %), step = 30.57 ps    (3.06 n%)
Pass: A_input =  6, B_input =  2, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  3, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  4, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  5, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  6, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  7, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  8, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  9, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input = 10, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 11, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 12, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 13, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 14, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 15, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input =  0, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  1, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  2, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  3, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  4, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  5, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  6, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  7, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  8, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  9, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 10, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 11, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 12, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 13, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 14, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 15, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input =  0, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  1, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  2, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  3, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  4, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  5, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  6, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  7, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  8, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input =  9, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 10, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 11, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 12, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 13, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 14, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 15, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input =  0, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  1, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  2, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  3, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  4, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  5, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
    tran: time = 25 ms        (2.5 %), step = 17.62 us    (1.76 m%)
Pass: A_input =  9, B_input =  6, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  7, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input =  8, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input =  9, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 10, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 11, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 12, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 13, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 14, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 15, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input =  0, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  1, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  2, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  3, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  4, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  5, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  6, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input =  7, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input =  8, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input =  9, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 10, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 11, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 12, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 13, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 14, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 15, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  0, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 11, B_input =  1, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 11, B_input =  2, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 11, B_input =  3, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 11, B_input =  4, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 11, B_input =  5, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  6, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  7, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  8, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  9, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 10, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 11, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 12, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 13, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 14, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 15, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  0, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 12, B_input =  1, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 12, B_input =  2, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 12, B_input =  3, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 12, B_input =  4, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  5, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  6, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  7, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  8, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  9, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 10, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 11, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 12, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 13, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 14, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 15, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  0, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 13, B_input =  1, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 13, B_input =  2, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 13, B_input =  3, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  4, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  5, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  6, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  7, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  8, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  9, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 10, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 11, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 12, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 13, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 14, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 15, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 1, Carry Out 1

Notice from spectre at time = 37.1003 ms during transient analysis `tran'.
    Found trapezoidal ringing on node hw3_1_adder_4bit_tb.sum[1].
Pass: A_input = 14, B_input =  0, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 14, B_input =  1, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 14, B_input =  2, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  3, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  4, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  5, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  6, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  7, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  8, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  9, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 10, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 11, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 12, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 13, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 14, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 15, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  0, c_in = 0, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 15, B_input =  1, c_in = 0, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  2, c_in = 0, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  3, c_in = 0, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1

    tran: time = 40.4 ms     (4.04 %), step = 54.42 ps    (5.44 n%)
Pass: A_input = 15, B_input =  4, c_in = 0, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  5, c_in = 0, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  6, c_in = 0, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  7, c_in = 0, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  8, c_in = 0, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  9, c_in = 0, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 10, c_in = 0, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 11, c_in = 0, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 12, c_in = 0, Expected Sum = 11, Sum = 11, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 13, c_in = 0, Expected Sum = 12, Sum = 12, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 14, c_in = 0, Expected Sum = 13, Sum = 13, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 15, c_in = 0, Expected Sum = 14, Sum = 14, Expected Carry Out = 1, Carry Out 1

Notice from spectre at time = 41.6001 ms during transient analysis `tran'.
    Found trapezoidal ringing on node hw3_1_adder_4bit_tb.I13.I3.I35.net9.
        Further occurrences of this notice will be suppressed (except in log
        file).
Pass: A_input =  0, B_input =  0, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  1, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  2, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  3, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  4, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  5, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  6, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  7, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  8, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input =  9, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 10, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 11, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 12, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 13, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 14, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  0, B_input = 15, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  1, B_input =  0, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  1, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  2, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  3, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  4, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  5, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  6, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  7, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  8, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input =  9, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 10, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 11, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 12, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 13, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  1, B_input = 14, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  1, B_input = 15, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  2, B_input =  0, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  1, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  2, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  3, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  4, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  5, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  6, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  7, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  8, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input =  9, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input = 10, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input = 11, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input = 12, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  2, B_input = 13, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  2, B_input = 14, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  2, B_input = 15, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  3, B_input =  0, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  1, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  2, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  3, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  4, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  5, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  6, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  7, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  8, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input =  9, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input = 10, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input = 11, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  3, B_input = 12, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  3, B_input = 13, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  3, B_input = 14, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  3, B_input = 15, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  4, B_input =  0, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  1, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  2, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  3, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  4, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  5, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  6, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  7, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  8, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input =  9, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input = 10, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  4, B_input = 11, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  4, B_input = 12, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  4, B_input = 13, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  4, B_input = 14, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  4, B_input = 15, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input =  0, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 0, Carry Out 0

    tran: time = 55.7 ms     (5.57 %), step = 21.24 ns    (2.12 u%)
Pass: A_input =  5, B_input =  1, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  2, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  3, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  4, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  5, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  6, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  7, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  8, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input =  9, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  5, B_input = 10, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input = 11, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input = 12, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input = 13, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input = 14, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  5, B_input = 15, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input =  0, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  1, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  2, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  3, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  4, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  5, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  6, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  7, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  8, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  6, B_input =  9, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 10, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 11, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 12, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 13, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 14, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  6, B_input = 15, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input =  0, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  1, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  2, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  3, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  4, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  5, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  6, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  7, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  7, B_input =  8, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input =  9, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 10, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 11, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 12, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 13, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 14, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  7, B_input = 15, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input =  0, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  1, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  2, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  3, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  4, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  5, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  6, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  8, B_input =  7, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input =  8, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input =  9, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 10, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 11, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 12, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 13, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 14, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  8, B_input = 15, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input =  0, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  1, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  2, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  3, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  4, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  5, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input =  9, B_input =  6, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input =  7, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input =  8, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input =  9, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 10, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 11, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 12, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 13, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 14, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input =  9, B_input = 15, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input =  0, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  1, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  2, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  3, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  4, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 10, B_input =  5, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input =  6, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input =  7, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input =  8, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input =  9, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 10, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 11, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 12, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 13, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 14, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 10, B_input = 15, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  0, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 11, B_input =  1, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 11, B_input =  2, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 11, B_input =  3, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 11, B_input =  4, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  5, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  6, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  7, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
    tran: time = 72 ms        (7.2 %), step = 21.79 ps    (2.18 n%)
Pass: A_input = 11, B_input =  8, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input =  9, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 10, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 11, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 12, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 13, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 14, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 11, B_input = 15, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  0, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 12, B_input =  1, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 12, B_input =  2, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 12, B_input =  3, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  4, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  5, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  6, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  7, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  8, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input =  9, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 10, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 11, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
    tran: time = 75 ms        (7.5 %), step = 9.324 us     (932 u%)
Pass: A_input = 12, B_input = 12, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 13, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 14, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 12, B_input = 15, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  0, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 13, B_input =  1, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 13, B_input =  2, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  3, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  4, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  5, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  6, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  7, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  8, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input =  9, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 10, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 11, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 12, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 13, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 14, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 13, B_input = 15, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  0, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 0, Carry Out 0
Pass: A_input = 14, B_input =  1, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  2, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  3, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  4, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  5, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  6, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  7, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  8, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input =  9, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 10, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 11, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 12, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 13, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 14, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 14, B_input = 15, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  0, c_in = 1, Expected Sum =  0, Sum =  0, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  1, c_in = 1, Expected Sum =  1, Sum =  1, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  2, c_in = 1, Expected Sum =  2, Sum =  2, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  3, c_in = 1, Expected Sum =  3, Sum =  3, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  4, c_in = 1, Expected Sum =  4, Sum =  4, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  5, c_in = 1, Expected Sum =  5, Sum =  5, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  6, c_in = 1, Expected Sum =  6, Sum =  6, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  7, c_in = 1, Expected Sum =  7, Sum =  7, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  8, c_in = 1, Expected Sum =  8, Sum =  8, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input =  9, c_in = 1, Expected Sum =  9, Sum =  9, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 10, c_in = 1, Expected Sum = 10, Sum = 10, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 11, c_in = 1, Expected Sum = 11, Sum = 11, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 12, c_in = 1, Expected Sum = 12, Sum = 12, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 13, c_in = 1, Expected Sum = 13, Sum = 13, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 14, c_in = 1, Expected Sum = 14, Sum = 14, Expected Carry Out = 1, Carry Out 1
Pass: A_input = 15, B_input = 15, c_in = 1, Expected Sum = 15, Sum = 15, Expected Carry Out = 1, Carry Out 1
Simulation complete via $finish(1) at time 83300 US + 0
/home/seas/jwcrandall/cadence/ECE_6240_Digital/hw3_1_adder_4bit_tb_vdriver/functional/verilog.v:38 	#10 $finish;
ncsim> exit
    tran: time = 83.4 ms      (100 %), step = 108.8 us     (91.7 %)
`AutoStop = yes'. Analysis finished at 83.3992 ms s.

Number of accepted tran steps =             65664

Notice from spectre during transient analysis `tran'.
    Trapezoidal ringing is detected during tran analysis.
        Please use method=trap for better results and performance.


~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Post-Transient Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
   -   To further speed up simulation, consider
          add ++aps on command line
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~


During simulation, the CPU load for active processors is :
        Spectre  0 (95.1 %)      1 (1.3 %)       2 (1.6 %)       4 (1.1 %)
                 5 (6.5 %)      
        Other   
Initial condition solution time: CPU = 12.998 ms, elapsed = 13.0019 ms.

**** AMSD: Mixed-Signal Activity Statistics ****
Number of A-to-D events:                    3468
  Number of A-to-D events in IEs:           3468
Number of D-to-A events:                    1040
  Number of D-to-A events in IEs:           1040
Number of VHDL-AMS Breaks:                     0

Intrinsic tran analysis time:    CPU = 51.8211 s, elapsed = 51.8742 s.
Total time required for tran analysis `tran': CPU = 51.8341 s, elapsed =
        51.8888 s.
Time accumulated: CPU = 52.2361 s, elapsed = 55.3668 s.
Peak resident memory used = 115 Mbytes.


Notice from spectre.
    63 notices suppressed.

finalTimeOP: writing operating point information to rawfile.

Opening the PSF file ../psf/finalTimeOP.info ...
modelParameter: writing model parameter values to rawfile.

Opening the PSF file ../psf/modelParameter.info ...
element: writing instance parameter values to rawfile.

Opening the PSF file ../psf/element.info ...
outputParameter: writing output parameter values to rawfile.

Opening the PSF file ../psf/outputParameter.info ...

Aggregate audit (2:34:50 PM, Tue Nov 27, 2018):
Time used: CPU = 52.3 s, elapsed = 55.4 s, util. = 94.3%.
Time spent in licensing: elapsed = 86.1 ms.
Peak memory used = 115 Mbytes.
Simulation started at: 2:33:54 PM, Tue Nov 27, 2018, ended at: 2:34:50 PM, Tue
        Nov 27, 2018, with elapsed time (wall clock): 55.4 s.
spectre completes with 0 errors, 0 warnings, and 9 notices.
ncsim: Memory Usage - 38.6M program + 465.9M data = 504.4M total (504.4M Peak)
ncsim: CPU Usage - 2.2s system + 54.0s user = 56.2s total (56.6s, 99.2% cpu)
